{"name": "SSE - Systemutvecklare Java - Bolagsverket", "description": "Deadline anbud: 7/2 2025\nStart 1/3 2025\n1 FTE\nTakpris: 975kr\nPå plats i Sundsvall\n\n**Huvudsakliga arbetsuppgifter**\n•\tSystemutveckling i huvudsak med inriktning mot Javautveckling (Java Spring Boot) med fokus på arbete med integration av autentiserings/auktorisationsprotokollen OAuth2 och OpenID Connect \n•\tContinous Integration/Continous deployment (CI/CD) och tillhörande containerhantering med delar såsom Docker, Kubernetes och Helm\n\n**Övriga arbetsuppgifter**\n•\tArbete med utveckling med verifiable credentials enligt standarder såsom JWT, SD-JWT, JWK, JOSE\n•\tArbete med att använda och definiera scheman baserade på JSON.\n•\tArbete med frontendutveckling (främst Vue3)\n•\tArbete med integrationer (ex Soap och REST)\n\n**Arbetssätt**\n•\tAgilt, iterativt och värdeskapande med SAFe som agilt ramverk och inspiration.\n•\tAgilt team med stort eget ansvar. \n\n**Teknik och verktyg**\nOAuth2, OpenID Connect, JSON, REST, Keycloak, GitLab, Splunk, Prometeus, WSO2, Maven, Vue3, Kubernetes, Docker, Helm, Git, Nginx, Insomnia, Jira, Confluence, Grafana.\n\n\n**Övergripande (*utanför anbudsprövningen*)**\nBolagsverket leder en EU-pilot för digitala plånböcker, med fokus på plånböcker för organisationer. Piloten ger möjlighet att testa teknik och användningsfall med verkliga intressenter. Bolagsverket vill använda plånböcker i sina processer för att: \n1)\tlogga in i e-tjänster\n2)\thantera underskrifter/stämplar\n3)\tutfärda attesteringar och \n4)\tta emot attesteringar\n\nTillsammans med en leverantör av en Wallet anpassar vi en plånbok för dessa ändamål.\nI rollen som Systemutvecklare - Backend/Frontend ingår Leverantören i ett team med produktägare och systemutvecklare som tillsammans ansvarar för att utveckla en pilot i syfte att utvärdera tekniken och användningsmönstren. Teamet samarbetar med ux-designer arkitekt, andra team samt andra organisationer inom piloten för digital plånbok.\n\nUnder 2025 kommer det att vara stort fokus på att bygga piloten och lösa en rad tekniska utmaningar för att sedan utvärdera helt konceptet.\n\nFör att lyckas långsiktigt handlar en viktig del av utvecklingsarbetet om att bygga för kvalitet och automatisering. Teamet har arbetsuppgifter med inslag av stöd till övriga och vi lägger stor vikt vid att teammedlemmarna klarar av att vägleda och hjälpa andra team.\n\nI det agila teamet arbetar Leverantören dagligen med:\n•\tutveckling initierad av Kundens verksamhet och Kundens samverkanspartners\n•\tbidra till utvecklingen med hänsyn till användbarhet och tillgänglighet \n•\tständiga förbättringar för att öka kvalitet och effektivitet \n\n", "required_skills": ["Java", "OAuth", "OpenID", "CICD", "JWT", "JSON", "REST", "GitLab", "WSO2", "Apache Maven", "Kubernetes", "Docker", "Git", "Atlassian Jira", "Atlassian Confluence", "Grafana"]}