{"name": "Senior testare JR-39203", "description": "\"Roll: Testare Nivå 4\nSenioritetsnivå: Senior\nPlats: Stockholm (SE)\nDistansarbete: 25%\nUppdragsperiod: 17 mar 2025 - 02 feb 2026\nAnsökningstiden löper ut: 29 jan 2025\nOmfattning: 100%\nSpråk: Svenska\n\n\nUppdragsbeskrivning\nTill vår kund Polismyndigheten söker vi en Testare.\nPolismyndigheten agerar på uppdrag från regeringen som utsedd passmyndighet. Uppdraget innebär att säkerställandet av att utfärda resehandlingar och identitetshandlingar till Sveriges invånare. Polismyndigheten ansvarar därmed för ansökan och utlämnande av resehandlingar, identitetshandlingar, personal, teknisk utrustning samt avtal med extern leverantör för tillverkning av resehandlingar. Sektionen Persondokument inom Polisens IT-avdelning ansvarar för att utveckla IT-stödet för ansökan och utlämning av resehandlingar och identitetshandlingar med tillhörande kringutrustning såsom biometristationer, passläsare nationellt och att motta ansökan om resehandling från utlandsmyndigheterna. IT-avdelningen är även ansvarig för det avtal som ingås med extern leverantör för tillverkningen av resehandlingar. Vidare upprätthåller IT-avdelningen en PKI-infrastruktur för utfärdande av resehandlingar och att dess publika delar utbyts med intressenter i andra länder.\nPolismyndigheten föreslås av regeringen till att bli ansvarig myndighet för införandet av ett statligt ID-kort med tillhörande e-legitimation. Detta innebär att Polismyndigheten ska vara ansvarig utfärdare och utgivare av en statlig e-legitimation vilket innebär att utveckla det IT-stöd som möjliggör att personer ska kunna ta del av och interagera mot elektroniska tjänster i det svenska samhället. Av ovan anledning söker vi nu förstärkning till sektionen Persondokument.\n\nSyftet med avropet är att förse Polismyndigheten med 1 testare med kompetensnivå 4. Gruppen Identitetshandlingar ingår i sektionen Persondokument och ansvarar för att utveckla egna anpassade lösningar relaterat till polisens arbete med att utfärda tjänster och produktioner inom området Identitetshantering. Uppdraget innebär att som medlem i utvecklingsteamet bidra till gruppens mål och utvecklingsarbete och säkerställa att dess leveranser håller en hög kvalité. \n\nGenom uppdraget som testare i gruppen Identitetshandlingar, ingår resursen i ett agilt arbetade team under ledning av en uppdragsledare. \n\nKonsulten ska i uppdraget:\nLeda QA-processen för flera produkter.\nTa ansvaret för test i ett agilt utvecklingsteam där det arbetas med flera utvecklingsprojekt parallellt och utveckling i en integrerad systemmiljö.\nUtifrån aktuella systems uppbyggnad ta fram strategi och plan för testning.\nUtföra såväl manuella som automatiska tester.\nBygga upp tester på olika nivåer för continuous integration.\nTesta system i stor utsträckning utan användargränssnitt, då system främst har andra system som användare. Detta kräver god förmåga att felsöka och analysera logfiler och felmeddelanden. \nSätta upp testmiljöer. \nÖverlämna och bistå med installation av testade programpaket.\nSjälvständigt driva och ansvara för tilldelade uppgifter.\nArbeta agilt i nära samarbete med uppdragsledare och systemutvecklare.\nAgera mentor och kunskapsöverföra testprocedurer till andra testresurser i arbetet\n \nKompetenskrav: \nKonsulten ska ha:\nminst 9 års arbetslivserfarenhet som testare. Erfarenheten ska ha införskaffats de senaste 15 åren.\narbetat med kodgranskning och automatiserad test i 5 år. Erfarenheten ska ha införskaffats de senaste 10 åren.\narbetat med testning av Java i minst 2 uppdrag. Erfarenheten ska ha införskaffats de senaste 7 åren.\narbetat med testning på containermiljö i minst 1 uppdrag. Erfarenheten ska ha införskaffats de senaste 7 åren.\ndokumenterad erfarenhet att arbeta med test och systemintegration i Linuxmiljö i minst 4 år. Erfarenheten ska vara införskaffad de senaste 7 åren.\ngod förmåga att uttrycka sig i tal och skrift på svenska och engelska.\n﻿\nMeriterande:\nKonsulten bör ha:\nerfarenhet av att leda QA-processen för flera produkter.\nerfarenhet av att bygga upp tester på olika nivåer för continuous integration.\nerfarenhet av att arbeta i ett agilt team.\nerfarenhet av att agera mentor och kunskapsöverföra till andra testresurser i arbetet.\n\nSäkerhetsprocess:\nPolismyndigheten ställer höga krav på konsults säkerhets- och sekretessmedvetenhet. Säkerhetsprövning med registerkontroll samt tecknande av säkerhetsskyddsavtal enligt säkerhetsskyddslagen (2018:585) kan komma att genomföras av konsult respektive konsults arbetsgivare innan Uppdragsavtalet kan göras gällande. I vissa fall krävs svenskt medborgarskap.\n\nMöjlighet till förlängning: 2027-02-01\n\nNödvändiga färdigheter\nTestning\nTestning av Java\nKodgranskning och automatiserad test\nMeriterande färdigheter\nQA-Processen\nAgilt arbete\"\n", "required_skills": ["software testing", "code audit", "test automation", "Java", "containerization", "system integration", "Linux", "Swedish", "continuous integration", "Agile methodology", "mentorship"]}